InformationRegisters/МЙ_ВетеринарныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>МЙ_ВетеринарныеДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>broker</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cargoExpertized</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cargoInspected</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>confirmedBy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>consigneeGuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>consigneeGuidBE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>consignorGuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>consignorGuidBE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>countryOfOriginGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dateOfProduction</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>expiryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>form</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_ФормаВетеринарногоСертификата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>issueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>issueNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>issueSeries</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>locationProsperity</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>lowGradeCargo</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ownerGuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>packingAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>packingList</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_ВидыУпаковки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>perishable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>producerGuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>producerRole</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_ВидПродукцииВетис</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>productGuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>productMarking</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьunitUUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>productItem</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>productItemGuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>productType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_ТипыПродукции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>specialMarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_СтатусВСД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>subProduct</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_ПродукцияВетис</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>subProductGuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>transportStorageType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МЙ_СпособыХраненияПриПеревозке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>type</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_ТипВСД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МЙ_СоответствиеЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>unitGuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vehicleNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>containerNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>trailerNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>volume</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>waybillSeries</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>waybillType</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>waybillDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>waybillNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>dateOfProductionEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>expiryDateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МЙ_ВетеринарныеДокументы/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучательФильтрПриИзменении(Элемент)
	
	ИзменилсяФильтр("Получатель", Получатель);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительКонтрагентФильтрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтправительКонтрагент) Тогда
		ОтправительСклад = Неопределено;
	КонецЕсли; 
	
	ИзменилсяФильтр("Отправитель", ОтправительКонтрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительСкладФильтрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтправительСклад) Тогда
		ОтправительКонтрагент = Неопределено;
	КонецЕсли; 
	
	ИзменилсяФильтр("Отправитель", ОтправительСклад);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменилсяФильтр(ИмяПоля, Значение)
	
	ЭлементОтбора = Неопределено;;
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	Для Каждого ТекущийЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ТекущийЭлементОтбора.ЛевоеЗначение = ПолеОтбора Тогда
			Если НЕ ЗначениеЗаполнено(Значение) ИЛИ ЭлементОтбора <> Неопределено Тогда
				ТекущийЭлементОтбора.Использование = Ложь;
			Иначе
				ЭлементОтбора = ТекущийЭлементОтбора;	
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;  
	
	Если ЗначениеЗаполнено(Значение) Тогда 
		Если ЭлементОтбора = Неопределено  Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
		КонецЕсли; 
		
		ЭлементОтбора.Использование = Истина;	
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Значение;;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПогаситьВСД(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;		
	
	Если Вопрос("Выполнить гашение ВСД?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда		
		Возврат;
	КонецЕсли;
	
	СписокВСД = Новый СписокЗначений;
	
	Для Каждого Строка ИЗ Элементы.Список.ВыделенныеСтроки Цикл
		СписокВСД.Добавить(ПолучитьUUIDПоКлючу(Строка));
	КонецЦикла;  	
	
	ПараметрыОтбора = Новый Массив;
	ОбменССистемойВетисКлиентСервер.ДобавитьПараметрОтбора(ПараметрыОтбора, "UUID_ВСД", ВидСравнения.ВСписке, СписокВСД);
	
	МассивПривязок = ОбменССистемойВетис.ПолучитьМассивПривязокВСД(ПараметрыОтбора);
	
	Погашено = 0;
	
	Для Каждого ПараметрыПривязки ИЗ МассивПривязок Цикл
		Если ОбменССистемойВетисКлиентСервер.ПогаситьВСД(ПараметрыПривязки) Тогда
			Погашено = Погашено + 1;			
		КонецЕсли;
	КонецЦикла;  
	
	Если МассивПривязок.Количество() > 0 Тогда
		Предупреждение("Погашено " + Погашено + " из "+ Элементы.Список.ВыделенныеСтроки.Количество() + " ВСД.");
		Элементы.Список.Обновить();
	Иначе
		Предупреждение("Не найдено подходящих ВСД для гашения!");
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписиВСД(UUID_ВСД)
	
	Возврат РегистрыСведений.МЙ_ВетеринарныеДокументы.СоздатьКлючЗаписи(Новый Структура("UUID", UUID_ВСД));
	
КонецФункции 

&НаСервере
Функция ПолучитьUUIDПоКлючу(Знач КлючЗаписи)
	
	Возврат КлючЗаписи.UUID;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеПоСтрокеСписка(Знач КлючЗаписи)
	
	СтрукутраВозврата = Новый Структура("Организация, consigneeGuid");
	Запись = РегистрыСведений.МЙ_ВетеринарныеДокументы.СоздатьМенеджерЗаписи();
	Запись.UUID = КлючЗаписи;
	Запись.Прочитать();
	
	ЗаполнитьЗначенияСвойств(СтрукутраВозврата, Запись);
	
	Возврат СтрукутраВозврата;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПоGUID(Команда)
	
	Результат = ОткрытьФормуМодально("РегистрСведений.МЙ_ВетеринарныеДокументы.Форма.ФормаЗагрузкиВСДПоGUID");
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Элементы.Список.Обновить();
		
		КлючЗаписи = ПолучитьКлючЗаписиВСД(Результат);
		
		ОткрытьФорму("РегистрСведений.МЙ_ВетеринарныеДокументы.Форма.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписи));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДокументПривязки" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументПривязки) Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ТипЗнч(Элемент.ТекущиеДанные.ДокументПривязки) = Тип("ДокументСсылка.ПриходныйОрдерСклад") Тогда
			ОткрытьФорму("Документ.ПриходныйОрдерСклад.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументПривязки));
		ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.ДокументПривязки) = Тип("ДокументСсылка.РасходныйОрдерСклад") Тогда
			ОткрытьФорму("Документ.РасходныйОрдерСклад.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.ДокументПривязки));
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ЭтоКопияБазы() Тогда
		Элементы.Список.ИзменятьСоставСтрок = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияФильтрПриИзменении(Элемент)
	ИзменилсяФильтр("Организация", Организация);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВСДНаСервере(ПараметрыЗагрузки)
	//ОбменССистемойВетис.ВыполнитьЗагрузкуИСопоставлениеВСД();
	
	Результат = ОбменССистемойВетис.ЗагрузитьДокументыФоновымЗаданием(ПараметрыЗагрузки.НастройкаАпи, ПараметрыЗагрузки.ДатаНачала, ПараметрыЗагрузки.ДатаОкончания);
	
	Если ТипЗнч(Результат) = Тип("ФоновоеЗадание") Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Запущена процедура загрузки документов, время начала:" + Строка(Результат.Начало);
		Сообщение.Сообщить();
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВСД(Команда)
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыПарамтеровЗагрузкиВСД", ЭтаФорма);		
	ОткрытьФорму("РегистрСведений.МЙ_ВетеринарныеДокументы.Форма.ФормаЗагрузкиВСД",,,,,,Оп);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПарамтеровЗагрузкиВСД(ПараметрыЗагрузки, ВходнойПараметр) Экспорт
	Если ЗначениеЗаполнено(ПараметрыЗагрузки) = Истина Тогда
		ЗагрузитьВСДНаСервере(ПараметрыЗагрузки);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьДанныеВСДНаСервере(СписокВСД)
	
	ТЗ_ВСД = Новый ТаблицаЗначений;
	ТЗ_ВСД.Колонки.Добавить("Организация");
	ТЗ_ВСД.Колонки.Добавить("GUID");
	ТЗ_ВСД.Колонки.Добавить("consigneeGuid");
	
	Для Каждого ЗначСписка ИЗ СписокВСД Цикл
		НСтр = ТЗ_ВСД.Добавить();
		НСтр.GUID = ЗначСписка.Значение;
		
		СтруктураДанных = ПолучитьДанныеПоСтрокеСписка(ЗначСписка.Значение);
		
		НСтр.Организация = СтруктураДанных.Организация;
		НСтр.consigneeGuid = СтруктураДанных.consigneeGuid;		
	КонецЦикла;  	
	
	
	ОбменССистемойВетис.ОбновитьВСД(ТЗ_ВСД);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеВСД(Команда)
	СписокВСД = Новый СписокЗначений;
	
	Для Каждого Строка ИЗ Элементы.Список.ВыделенныеСтроки Цикл
		СписокВСД.Добавить(ПолучитьUUIDПоКлючу(Строка));
	КонецЦикла; 
	
	ОбновитьДанныеВСДНаСервере(СписокВСД);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВСДСписком(Команда)
	ОткрытьФорму("Обработка.МЙ_ЗагрузкаВСДСписком.Форма.Форма");
КонецПроцедуры


&НаКлиенте
Процедура АннулироватьВСД(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;		
	
	Если Вопрос("Аннулировать выделенные ВСД?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда		
		Возврат;
	КонецЕсли;
	
	СписокВСД = Новый Массив;
	
	Для Каждого Строка ИЗ Элементы.Список.ВыделенныеСтроки Цикл
		СписокВСД.Добавить(ПолучитьUUIDПоКлючу(Строка));
	КонецЦикла;  
	
	
	ОбменССистемойВетисКлиентСервер.АннулироватьВСД(СписокВСД);
	
	//Погашено = 0;
	//
	//Для Каждого ПараметрыПривязки ИЗ МассивПривязок Цикл
	//	Если ОбменССистемойВетисКлиентСервер.ПогаситьВСД(ПараметрыПривязки) Тогда
	//		Погашено = Погашено + 1;			
	//	КонецЕсли;
	//КонецЦикла;  	
	
КонецПроцедуры
